**FREE

/IF DEFINED(R5EXCMGR_H)
/EOF
/ENDIF
/DEFINE R5EXCMGR_H

//  Package : RPG5LIB
//  SrvPgm  : R5EXCMGR
//
//  R5EXCMGR_H
//
//  RPG5LIB Exception manager
//
//  November 2021
//
//  Use:
//
//  /COPY RPG5LIB,r5excmgr_h


/COPY RPG5LIB,exceptionh
/COPY RPG5LIB,excmgr_h
/COPY RPG5LIB,callstackh
/COPY RPG5LIB,callstke_h

