**FREE

/IF DEFINED(R5UTILS_H)
/EOF
/ENDIF
/DEFINE R5UTILS_H

//  Package : RPG5LIB
//  SrvPgm  : R5UTILS
//
//  R5UTILS_H
//
//  RPG5LIB Utilities
//
//  October 2021
//
//  Usage:
//
//  /COPY RPG5LIB,r5utils_h


/COPY RPG5LIB,apierror_h
/COPY RPG5LIB,errno_h
/COPY RPG5LIB,iif_h
/COPY RPG5LIB,in_h
/COPY RPG5LIB,joblog_h
/COPY RPG5LIB,math_h
/COPY RPG5LIB,calllevelh
/COPY RPG5LIB,iif_h
